app/controllers/events_controller.rb

INSERT INTO "events" ("name", "created_at", "updated_at", "description", "is_public") VALUES('how do you do', '2010-07-06 10:19:42', '2010-07-06 10:19:42', 'when you met someone you know , remember to say ''how do you do''.', NULL)
---
  def create
    @event = Event.new(params[:event])
    if @event.save

UPDATE "events" SET "updated_at" = '2010-07-06 10:09:10', "name" = 'first math course', "description" = 'in this course, we teach students how to count from 1 to 100.' WHERE "id" = 1
---
  def update
    #@event = Event.find(params[:id])
    if @event.update_attributes(params[:event])

DELETE FROM "events" WHERE "id" = 1
---
  def destroy
    #@event = Event.find(params[:id])
    @event.destroy

SELECT * FROM "events" WHERE ("events"."id" = '--- :first
---
  def find_event
    @event = Event.find(params[:id])